Revit 2027 API
SpecTypeId.WeightPerUnitLength Property
 Weight per Unit Length, in discipline Structural.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId WeightPerUnitLength { get; }
Public Shared ReadOnly Property WeightPerUnitLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ WeightPerUnitLength {
	ForgeTypeId^ get ();
}
static member WeightPerUnitLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace